bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/icu_lld.h
#if (SPC5_ICU_USE_SMOD12 == TRUE || SPC5_ICU_USE_SMOD13 == TRUE || \
     SPC5_ICU_USE_SMOD14 == TRUE || SPC5_ICU_USE_SMOD15 == TRUE || \
     SPC5_ICU_USE_SMOD16 == TRUE || SPC5_ICU_USE_SMOD17 == TRUE)
#define SPC5_ICU_USE_ETIMER2                TRUE
#else
#define SPC5_ICU_USE_ETIMER2                FALSE
#endif

#if (SPC5_ICU_USE_SMOD18 == TRUE || SPC5_ICU_USE_SMOD19 == TRUE || \
     SPC5_ICU_USE_SMOD20 == TRUE || SPC5_ICU_USE_SMOD21 == TRUE || \
     SPC5_ICU_USE_SMOD22 == TRUE || SPC5_ICU_USE_SMOD23 == TRUE)
#define SPC5_ICU_USE_ETIMER3                TRUE
#else
#define SPC5_ICU_USE_ETIMER3                FALSE
#endif
											 
#if (SPC5_HAS_ETIMER0 == FALSE && SPC5_ICU_USE_ETIMER0 == TRUE)
#error "ETIMER0 not present in the selected device"
#endif

#if (SPC5_HAS_ETIMER1 == FALSE && SPC5_ICU_USE_ETIMER1 == TRUE)
#error "ETIMER1 not present in the selected device"
#endif

#if (SPC5_HAS_ETIMER2 == FALSE && SPC5_ICU_USE_ETIMER2 == TRUE)
#error "ETIMER2 not present in the selected device"
#endif

#if (SPC5_HAS_ETIMER3 == FALSE && SPC5_ICU_USE_ETIMER3 == TRUE)
#error "ETIMER3 not present in the selected device"
#endif

#if (SPC5_ICU_USE_ETIMER0 == FALSE && SPC5_ICU_USE_ETIMER1 == FALSE && \
     SPC5_ICU_USE_ETIMER2 == FALSE && SPC5_ICU_USE_ETIMER3 == FALSE)
#error "ICU driver activated but no SMOD peripheral assigned"
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a structure representing an ICU driver.
 */
typedef struct ICUDriver ICUDriver;

/**
 * @brief   ICU notification callback type.
 *
 * @param[in] icup      pointer to a @p ICUDriver object
 */
typedef void (*icucallback_t)(ICUDriver *icup);

/**
 * @brief ICU driver mode.
 */
typedef enum {
  ICU_INPUT_ACTIVE_HIGH = 0, /**< Trigger on rising edge.            */
  ICU_INPUT_ACTIVE_LOW = 1   /**< Trigger on falling edge.           */
} icumode_t;

/**
 * @brief   ICU frequency type.
 */
typedef uint32_t icufreq_t;

/**
 * @brief   ICU channel.
 */
typedef enum {
  ICU_CHANNEL_1 = 0, /**< Use SMODxCH1.      */
  ICU_CHANNEL_2 = 1, /**< Use SMODxCH2.      */
  ICU_CHANNEL_3 = 2, /**< Use SMODxCH3.      */
  ICU_CHANNEL_4 = 3, /**< Use SMODxCH4.      */
  ICU_CHANNEL_5 = 4, /**< Use SMODxCH5.      */
  ICU_CHANNEL_6 = 5  /**< Use SMODxCH6.      */
} icuchannel_t;

/**
 * @brief   ICU counter type.
 */
typedef uint16_t icucnt_t;

/**
 * @brief   Driver configuration structure.
 * @note    It could be empty on some architectures.
 */
typedef struct {
  /**
   * @brief   Driver mode.
   */
  icumode_t mode;
  /**
   * @brief   Timer clock in Hz.
   */
  icufreq_t frequency;
  /**
   * @brief   Callback for pulse width measurement.
   */
  icucallback_t width_cb;
  /**
   * @brief   Callback for cycle period measurement.
   */
  icucallback_t period_cb;
  /**
   * @brief   Callback for timer overflow.
   */
  icucallback_t overflow_cb;
  /* End of the mandatory fields.*/
} ICUConfig;

/**
 * @brief   Structure representing an ICU driver.
 */
struct ICUDriver {
  /**
   * @brief Current configuration data.
   */
  const ICUConfig           *config;
#if defined(ICU_DRIVER_EXT_FIELDS)
  ICU_DRIVER_EXT_FIELDS
#endif
  /* End of the mandatory fields.*/
  /**
   * @brief Clock value for this unit.
   */
  uint32_t                  clock;
  /**
   * @brief eTimer submodule number.
   */
  uint32_t                  smod_number;
  /**
   * @brief Pointer to the eTimerx registers block.
   */
  volatile struct spc5_etimer *etimerp;
  /**
   * @brief CCR register used for width capture.
   */
  volatile vuint16_t        *wccrp;
  /**
   * @brief CCR register used for period capture.
   */
  volatile vuint16_t        *pccrp;
};

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the width of the latest pulse.
 * @details The pulse width is defined as number of ticks between the start
 *          edge and the stop edge.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 * @return              The number of ticks.
 *
 * @notapi
 */
#define icu_lld_get_width(icup) (*((icup)->wccrp) + 1)

/**
 * @brief   Returns the width of the latest cycle.
 * @details The cycle width is defined as number of ticks between a start
 *          edge and the next start edge.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 * @return              The number of ticks.
 *
 * @notapi
 */
#define icu_lld_get_period(icup) (*((icup)->pccrp) + 1)

/**
 * @name    Low Level driver helper macros
 * @{
 */
/**
 * @brief   Common ISR code, ICU width event.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
#define _icu_isr_invoke_width_cb(icup) {                                    \
  (icup)->config->width_cb(icup);                                           \
}

/**
 * @brief   Common ISR code, ICU period event.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
#define _icu_isr_invoke_period_cb(icup) {                                   \
  (icup)->config->period_cb(icup);                                          \
}

/**
 * @brief   Common ISR code, ICU timer overflow event.
 *
 * @param[in] icup      pointer to the @p ICUDriver object
 *
 * @notapi
 */
#define _icu_isr_invoke_overflow_cb(icup) {                                 \
  (icup)->config->overflow_cb(icup);                                        \
}
/** @} */

/*===========================================================================*/
/* IRQ Handlers                                                              */
/*===========================================================================*/

#if (SPC5_ICU_USE_SMOD0 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC0IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD0 */

#if (SPC5_ICU_USE_SMOD1 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC1IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD1 */

#if (SPC5_ICU_USE_SMOD2 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC2IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD2 */

#if (SPC5_ICU_USE_SMOD3 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC3IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD3 */

#if (SPC5_ICU_USE_SMOD4 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC4IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD4 */

