bhsh/spc560/SPC560Pxx_RLA STM Test Application for Discovery/components/spc560pxx_low_level_drivers_component_rla/lib/include/icu_lld.h
#if (SPC5_ICU_USE_SMOD5 == TRUE)
IRQ_HANDLER(SPC5_ETIMER0_TC5IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD5 */

#if (SPC5_ICU_USE_SMOD6 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC0IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD6 */

#if (SPC5_ICU_USE_SMOD7 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC1IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD7 */

#if (SPC5_ICU_USE_SMOD8 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC2IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD8 */

#if (SPC5_ICU_USE_SMOD9 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC3IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD9 */

#if (SPC5_ICU_USE_SMOD10 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC4IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD10 */

#if (SPC5_ICU_USE_SMOD11 == TRUE)
IRQ_HANDLER(SPC5_ETIMER1_TC5IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD11 */

#if (SPC5_ICU_USE_SMOD12 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC0IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD12 */

#if (SPC5_ICU_USE_SMOD13 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC1IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD13 */

#if (SPC5_ICU_USE_SMOD14 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC2IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD14 */

#if (SPC5_ICU_USE_SMOD15 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC3IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD15 */

#if (SPC5_ICU_USE_SMOD16 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC4IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD16 */

#if (SPC5_ICU_USE_SMOD17 == TRUE)
IRQ_HANDLER(SPC5_ETIMER2_TC5IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD17 */

#if (SPC5_ICU_USE_SMOD18 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC0IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD18 */

#if (SPC5_ICU_USE_SMOD19 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC1IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD19 */

#if (SPC5_ICU_USE_SMOD20 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC2IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD20 */

#if (SPC5_ICU_USE_SMOD21 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC3IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD21 */

#if (SPC5_ICU_USE_SMOD22 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC4IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD22 */

#if (SPC5_ICU_USE_SMOD23 == TRUE)
IRQ_HANDLER(SPC5_ETIMER3_TC5IR_HANDLER);
#endif /* SPC5_ICU_USE_SMOD23 */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if (SPC5_ICU_USE_SMOD0 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD1;
#endif

#if (SPC5_ICU_USE_SMOD1 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD2;
#endif

#if (SPC5_ICU_USE_SMOD2 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD3;
#endif

#if (SPC5_ICU_USE_SMOD3 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD4;
#endif

#if (SPC5_ICU_USE_SMOD4 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD5;
#endif

#if (SPC5_ICU_USE_SMOD5 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD6;
#endif

#if (SPC5_ICU_USE_SMOD6 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD7;
#endif

#if (SPC5_ICU_USE_SMOD7 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD8;
#endif

#if (SPC5_ICU_USE_SMOD8 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD9;
#endif

#if (SPC5_ICU_USE_SMOD9 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD10;
#endif

#if (SPC5_ICU_USE_SMOD10 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD11;
#endif

#if (SPC5_ICU_USE_SMOD11 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD12;
#endif

#if (SPC5_ICU_USE_SMOD12 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD13;
#endif

#if (SPC5_ICU_USE_SMOD13 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD14;
#endif

#if (SPC5_ICU_USE_SMOD14 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD15;
#endif

#if (SPC5_ICU_USE_SMOD15 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD16;
#endif

#if (SPC5_ICU_USE_SMOD16 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD17;
#endif

#if (SPC5_ICU_USE_SMOD17 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD18;
#endif

#if (SPC5_ICU_USE_SMOD18 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD19;
#endif

#if (SPC5_ICU_USE_SMOD19 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD20;
#endif

#if (SPC5_ICU_USE_SMOD20 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD21;
#endif

#if (SPC5_ICU_USE_SMOD21 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD22;
#endif

#if (SPC5_ICU_USE_SMOD22 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD23;
#endif

#if (SPC5_ICU_USE_SMOD23 == TRUE) && !defined(__DOXYGEN__)
extern ICUDriver ICUD24;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void icu_lld_init(void);
  void icu_lld_start(ICUDriver *icup, const ICUConfig *config);
  void icu_lld_stop(ICUDriver *icup);
  void icu_lld_enable(ICUDriver *icup);
  void icu_lld_disable(ICUDriver *icup);
#ifdef __cplusplus
}
#endif

#endif /* LLD_USE_ICU */

#endif /* _ICU_LLD_H_ */

/** @} */
